const getTags = function (sheet) {
  let tags = [];
  sheet.celldata.forEach((e) => {
    tags.push(e.v.v);
  });
  return tags;
};
const getNoticeEnterSheet = function (name = "sheet1") {
  return {
    name: name,
    // index: index,
    status: 0,
    order: 1,
    config: {
      columnlen: {
        0: 34,
        1: 74,
        2: 59,
        3: 58,
        4: 39,
        5: 61,
        6: 64,
        7: 78,
        8: 37,
        9: 70,
        10: 71,
        11: 70,
        12: 88,
        13: 132,
        14: 34,
      },
      customWidth: {
        0: 1,
        1: 1,
        2: 1,
        3: 1,
        4: 1,
        5: 1,
        6: 1,
        7: 1,
        8: 1,
        9: 1,
        10: 1,
        11: 1,
        12: 1,
        13: 1,
        14: 1,
      },
    },
    celldata: [
      {
        r: 0,
        c: 0,
        v: {
          tb: 1,
          v: "序号",
          qp: 1,
          m: "序号",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 1,
        v: {
          tb: 1,
          v: "型号",
          qp: 1,
          m: "型号",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 2,
        v: {
          tb: 1,
          v: "长度",
          qp: 1,
          m: "长度",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 3,
        v: {
          tb: 1,
          v: "宽度",
          qp: 1,
          m: "宽度",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 4,
        v: {
          tb: 1,
          v: "数量",
          qp: 1,
          m: "数量",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 5,
        v: {
          tb: 1,
          v: "剪长度",
          qp: 1,
          m: "剪长度",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 6,
        v: {
          tb: 1,
          v: "剪宽度",
          qp: 1,
          m: "剪宽度",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 7,
        v: {
          tb: 1,
          v: "计数",
          qp: 1,
          m: "计数",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 8,
        v: {
          tb: 1,
          v: "备品",
          qp: 1,
          m: "备品",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 9,
        v: {
          tb: 1,
          v: "总长度",
          qp: 1,
          m: "总长度",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 10,
        v: {
          tb: 1,
          v: "下单面积",
          qp: 1,
          m: "下单面积",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 11,
        v: {
          tb: 1,
          v: "生产面积",
          qp: 1,
          m: "生产面积",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 12,
        v: {
          tb: 1,
          v: "地块户型",
          qp: 1,
          m: "地块户型",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 13,
        v: {
          tb: 1,
          v: "位置",
          qp: 1,
          m: "位置",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 14,
        v: {
          tb: 1,
          v: "箱号",
          qp: 1,
          m: "箱号",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
    ],
  };
};
const getNoticeQuerySheet = function (name = "sheet1") {
  return {
    name: name,
    // index: index,
    status: 0,
    order: 1,
    config: {
      columnlen: {
        0: 125,
        1: 119,
        2: 124,
        3: 52,
        4: 141,
        5: 163,
        6: 50,
        7: 50,
        8: 50,
        9: 50,
        10: 50,
        11: 50,
        12: 50,
        13: 50,
        14: 50,
        15: 50,
        16: 50,
        17: 50,
        18: 50,
        19: 50,
        20: 50,
        21: 50
      },
      customWidth: {
        0: 1,
        1: 1,
        2: 1,
        3: 1,
        4: 1,
        5: 1,
        6: 1,
        7: 1,
        8: 1,
        9: 1,
        10: 1,
        11: 1,
        12: 1,
        13: 1,
        14: 1,
        15: 1,
        16: 1,
        17: 1,
        18: 1,
        19: 1,
        20: 1,
        21: 1
      },
    },
    celldata: [
      {
        r: 0,
        c: 0,
        v: {
          tb: 1,
          v: "工作单号",
          qp: 1,
          m: "工作单号",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 1,
        v: {
          tb: 1,
          v: "日期",
          qp: 1,
          m: "日期",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 2,
        v: {
          tb: 1,
          v: "品名",
          qp: 1,
          m: "品名",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 3,
        v: {
          tb: 1,
          v: "套数",
          qp: 1,
          m: "套数",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 4,
        v: {
          tb: 1,
          v: "项目名称",
          qp: 1,
          m: "项目名称",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 5,
        v: {
          tb: 1,
          v: "客户名称",
          qp: 1,
          m: "客户名称",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 6,
        v: {
          tb: 1,
          v: "整理要求",
          qp: 1,
          m: "整理要求",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 7,
        v: {
          tb: 1,
          v: "方向",
          qp: 1,
          m: "方向",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 8,
        v: {
          tb: 1,
          v: "包装要求",
          qp: 1,
          m: "包装要求",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 9,
        v: {
          tb: 1,
          v: "总片数",
          qp: 1,
          m: "总片数",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 10,
        v: {
          tb: 1,
          v: "总长度",
          qp: 1,
          m: "总长度",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 11,
        v: {
          tb: 1,
          v: "总面积",
          qp: 1,
          m: "总面积",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 12,
        v: {
          tb: 1,
          v: "实际生产片数",
          qp: 1,
          m: "实际生产片数",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 13,
        v: {
          tb: 1,
          v: "实际生产面积",
          qp: 1,
          m: "实际生产面积",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 14,
        v: {
          tb: 1,
          v: "下单日期",
          qp: 1,
          m: "下单日期",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 15,
        v: {
          tb: 1,
          v: "员工名",
          qp: 1,
          m: "员工名",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 16,
        v: {
          tb: 1,
          v: "检测报告数",
          qp: 1,
          m: "检测报告数",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 17,
        v: {
          tb: 1,
          v: "合格证个数",
          qp: 1,
          m: "合格证个数",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 18,
        v: {
          tb: 1,
          v: "签回单数",
          qp: 1,
          m: "签回单数",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 19,
        v: {
          tb: 1,
          v: "其他",
          qp: 1,
          m: "其他",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 20,
        v: {
          tb: 1,
          v: "快递公司",
          qp: 1,
          m: "快递公司",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 21,
        v: {
          tb: 1,
          v: "快递单号",
          qp: 1,
          m: "快递单号",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      }
    ],
  };
};
const getMotherBillSheet = function (name = "sheet1") {
  return {
    name: name,
    // index: index,
    status: 0,
    order: 1,
    config: {
      columnlen: {
        0: 39,
        1: 92,
        2: 94,
        3: 98,
        4: 108,
        5: 106,
        6: 92,
        7: 107,
        8: 52,
        9: 77,
      },
      customWidth: {
        0: 1,
        1: 1,
        2: 1,
        3: 1,
        4: 1,
        5: 1,
        6: 1,
        7: 1,
        8: 1,
        9: 1,
      },
    },
    celldata: [
      {
        r: 0,
        c: 0,
        v: {
          tb: 1,
          v: "序号",
          qp: 1,
          m: "序号",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 1,
        v: {
          tb: 1,
          v: "日期",
          qp: 1,
          m: "日期",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 2,
        v: {
          tb: 1,
          v: "母单号",
          qp: 1,
          m: "母单号",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 3,
        v: {
          tb: 1,
          v: "客户名",
          qp: 1,
          m: "客户名",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 4,
        v: {
          tb: 1,
          v: "项目名",
          qp: 1,
          m: "项目名",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 5,
        v: {
          tb: 1,
          v: "整理要求",
          qp: 1,
          m: "整理要求",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 6,
        v: {
          tb: 1,
          v: "整理方向",
          qp: 1,
          m: "整理方向",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 7,
        v: {
          tb: 1,
          v: "包装要求",
          qp: 1,
          m: "包装要求",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 8,
        v: {
          tb: 1,
          v: "套数",
          qp: 1,
          m: "套数",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 9,
        v: {
          tb: 1,
          v: "户型",
          qp: 1,
          m: "户型",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
    ],
  };
};
const getMBQuerySheet = function (name = "sheet1") {
  return {
    name: name,
    // index: index,
    status: 0,
    order: 1,
    config: {
      columnlen: {
        0: 125,
        1: 119,
        2: 130,
        3: 52,
        4: 141,
        5: 163,
      },
      customWidth: {
        0: 1,
        1: 1,
        2: 1,
        3: 1,
        4: 1,
        5: 1,
      },
    },
    celldata: [
      {
        r: 0,
        c: 0,
        v: {
          tb: 1,
          v: "母单号",
          qp: 1,
          m: "母单号",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 1,
        v: {
          tb: 1,
          v: "日期",
          qp: 1,
          m: "日期",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 2,
        v: {
          tb: 1,
          v: "户型",
          qp: 1,
          m: "户型",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 3,
        v: {
          tb: 1,
          v: "套数",
          qp: 1,
          m: "套数",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 4,
        v: {
          tb: 1,
          v: "项目名称",
          qp: 1,
          m: "项目名称",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 5,
        v: {
          tb: 1,
          v: "客户名称",
          qp: 1,
          m: "客户名称",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
    ],
  };
};
const getMotherBillArrangeSheet = function (name = "sheet1") {
  return {
    name: name,
    // index: index,
    status: 0,
    order: 1,
    config: {
      columnlen: {
        0: 120,
        1: 120,
        2: 94,
        3: 98,
        4: 200,
        5: 106,
        6: 92,
        7: 70,
        8: 80,
      },
      customWidth: {
        0: 1,
        1: 1,
        2: 1,
        3: 1,
        4: 1,
        5: 1,
        6: 1,
        7: 1,
        8: 1,
      },
    },
    celldata: [
      {
        r: 0,
        c: 0,
        v: {
          tb: 1,
          v: "日期",
          qp: 1,
          m: "日期",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 1,
        v: {
          tb: 1,
          v: "母单号",
          qp: 1,
          m: "母单号",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 2,
        v: {
          tb: 1,
          v: "客户名",
          qp: 1,
          m: "客户名",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 3,
        v: {
          tb: 1,
          v: "项目名",
          qp: 1,
          m: "项目名",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 4,
        v: {
          tb: 1,
          v: "整理要求",
          qp: 1,
          m: "整理要求",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 5,
        v: {
          tb: 1,
          v: "整理方向",
          qp: 1,
          m: "整理方向",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 6,
        v: {
          tb: 1,
          v: "包装要求",
          qp: 1,
          m: "包装要求",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 7,
        v: {
          tb: 1,
          v: "套数",
          qp: 1,
          m: "套数",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 8,
        v: {
          tb: 1,
          v: "户型",
          qp: 1,
          m: "户型",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
    ],
  };
};
const getProductOutputSheet = function (name = "sheet1") {
  return {
    name: name,
    // index: index,
    status: 0,
    order: 1,
    config: {
      columnlen: {
        0: 128,
        1: 39,
        2: 95,
        3: 68,
        4: 62,
        5: 39,
        6: 61,
        7: 64,
        8: 48,
        9: 53,
        10: 80,
        11: 76,
        12: 81,
        13: 160,
        14: 80,
        15: 80,
        16: 80
      },
      customWidth: {
        0: 1,
        1: 1,
        2: 1,
        3: 1,
        4: 1,
        5: 1,
        6: 1,
        7: 1,
        8: 1,
        9: 1,
        10: 1,
        11: 1,
        12: 1,
        13: 1,
        14: 1,
        15: 1,
        16: 1 
      },
    },
    celldata: [
      {
        r: 0,
        c: 0,
        v: {
          tb: 1,
          v: "单号",
          qp: 1,
          m: "单号",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 1,
        v: {
          tb: 1,
          v: "序号",
          qp: 1,
          m: "序号",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 2,
        v: {
          tb: 1,
          v: "日期",
          qp: 1,
          m: "日期",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 3,
        v: {
          tb: 1,
          v: "操作人",
          qp: 1,
          m: "操作人",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 4,
        v: {
          tb: 1,
          v: "岗位",
          qp: 1,
          m: "岗位",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 5,
        v: {
          tb: 1,
          v: "箱号",
          qp: 1,
          m: "箱号",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 6,
        v: {
          tb: 1,
          v: "长度",
          qp: 1,
          m: "长度",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 7,
        v: {
          tb: 1,
          v: "宽度",
          qp: 1,
          m: "宽度",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 8,
        v: {
          tb: 1,
          v: "数量",
          qp: 1,
          m: "数量",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 9,
        v: {
          tb: 1,
          v: "备品",
          qp: 1,
          m: "备品",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 10,
        v: {
          tb: 1,
          v: "总长度",
          qp: 1,
          m: "总长度",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 11,
        v: {
          tb: 1,
          v: "面积",
          qp: 1,
          m: "面积",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 12,
        v: {
          tb: 1,
          v: "实际面积",
          qp: 1,
          m: "实际面积",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 13,
        v: {
          tb: 1,
          v: "id(请勿做任何更改！！)",
          qp: 1,
          m: "id(请勿做任何更改！！)",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 14,
        v: {
          tb: 1,
          v: "已生产套数",
          qp: 1,
          m: "已生产套数",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 15,
        v: {
          tb: 1,
          v: "总套数",
          qp: 1,
          m: "总套数",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 16,
        v: {
          tb: 1,
          v: "原始单据",
          qp: 1,
          m: "原始单据",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      }
    ],
  };
};
const getPOItemEntrySheet = function (name = "sheet1") {
  return {
    name: name,
    // index: index,
    status: 0,
    order: 1,
    config: {
      columnlen: {
        0: 102,
        1: 44,
        2: 48,
        3: 61,
        4: 64,
        5: 103,
        6: 48,
        7: 53,
        8: 80,
        9: 76,
        10: 81,
        11: 160,
        12: 80,
        13: 80,
        14: 80,
      },
      customWidth: {
        0: 1,
        1: 1,
        2: 1,
        3: 1,
        4: 1,
        5: 1,
        6: 1,
        7: 1,
        8: 1,
        9: 1,
        10: 1,
        11: 1,
        12: 1,
        13: 1,
        14: 1
      },
    },
    celldata: [
      {
        r: 0,
        c: 0,
        v: {
          tb: 1,
          v: "单号",
          qp: 1,
          m: "单号",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 1,
        v: {
          tb: 1,
          v: "序号",
          qp: 1,
          m: "序号",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 2,
        v: {
          tb: 1,
          v: "箱号",
          qp: 1,
          m: "箱号",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 3,
        v: {
          tb: 1,
          v: "长度",
          qp: 1,
          m: "长度",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 4,
        v: {
          tb: 1,
          v: "宽度",
          qp: 1,
          m: "宽度",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 5,
        v: {
          tb: 1,
          v: "计数",
          qp: 1,
          m: "计数",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 6,
        v: {
          tb: 1,
          v: "数量",
          qp: 1,
          m: "数量",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 7,
        v: {
          tb: 1,
          v: "备品",
          qp: 1,
          m: "备品",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 8,
        v: {
          tb: 1,
          v: "总长度",
          qp: 1,
          m: "总长度",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 9,
        v: {
          tb: 1,
          v: "下单面积",
          qp: 1,
          m: "下单面积",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 10,
        v: {
          tb: 1,
          v: "生产面积",
          qp: 1,
          m: "生产面积",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 11,
        v: {
          tb: 1,
          v: "id(请勿做任何更改！！)",
          qp: 1,
          m: "id(请勿做任何更改！！)",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 12,
        v: {
          tb: 1,
          v: "已生产套数",
          qp: 1,
          m: "已生产套数",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 13,
        v: {
          tb: 1,
          v: "总套数",
          qp: 1,
          m: "总套数",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 14,
        v: {
          tb: 1,
          v: "原始单据",
          qp: 1,
          m: "原始单据",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      }
    ],
  };
};
const getPOItemEntrySpare = function (name = "sheet1") {
  return {
    name: name,
    // index: index,
    status: 0,
    order: 1,
    config: {
      columnlen: {
        0: 100,
        1: 100,
        2: 60,
        3: 140,
      },
      customWidth: {
        0: 1,
        1: 1,
        2: 1,
        3: 1,
      },
    },
    celldata: [
      {
        r: 0,
        c: 0,
        v: {
          tb: 1,
          v: "长度",
          qp: 1,
          m: "长度",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 1,
        v: {
          tb: 1,
          v: "宽度",
          qp: 1,
          m: "宽度",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 2,
        v: {
          tb: 1,
          v: "数量",
          qp: 1,
          m: "数量",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 3,
        v: {
          tb: 1,
          v: "面积",
          qp: 1,
          m: "面积",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
    ],
  };
};

const getPOOther = function (name = "sheet1") {
  return {
    name: name,
    // index: index,
    status: 0,
    order: 1,
    config: {
      columnlen: {
        0: 120,
        1: 300,
        2: 300
      },
      customWidth: {
        0: 1,
        1: 1,
        2: 1
      },
    },
    celldata: [
      {
        r: 0,
        c: 0,
        v: {
          tb: 1,
          v: "日期",
          qp: 1,
          m: "日期",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 1,
        v: {
          tb: 1,
          v: "操作人",
          qp: 1,
          m: "操作人",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      },
      {
        r: 0,
        c: 2,
        v: {
          tb: 1,
          v: "备注",
          qp: 1,
          m: "备注",
          ct: {
            fa: "@",
            t: "s",
          },
        },
      }
    ],
  };
};
const blue = "#DDEBF7"
const getLargeProject = function (selectedData) {
  return {
    name: "sheet1",
    // index: index,
    status: 0,
    order: 1,
    config: {
      "columnlen": {
        "0": 74,
        "4": 81,
        "5": 83,
        "6": 137,
        "7": 93
      },
      "customWidth": {
        "0": 1,
        "4": 1,
        "5": 1,
        "6": 1,
        "7": 1
      },
      "rowlen": {
        "0": 37,
        "1": 19,
        "2": 19,
        "3": 19,
        "4": 19,
        "5": 19,
        "6": 36,
        "7": 19
      },
      "customHeight": {
        "0": 1,
        "6": 1
      },
      "merge": {
        "6_2": {
          "r": 6,
          "c": 2,
          "rs": 1,
          "cs": 2
        },
        "0_0": {
          "r": 0,
          "c": 0,
          "rs": 1,
          "cs": 8
        },
        "1_1": {
          "r": 1,
          "c": 1,
          "rs": 1,
          "cs": 7
        },
        "2_1": {
          "r": 2,
          "c": 1,
          "rs": 1,
          "cs": 7
        },
        "3_1": {
          "r": 3,
          "c": 1,
          "rs": 1,
          "cs": 7
        },
        "5_1": {
          "r": 5,
          "c": 1,
          "rs": 1,
          "cs": 7
        },
        "4_1": {
          "r": 4,
          "c": 1,
          "rs": 1,
          "cs": 7
        }
      }
    },
    celldata: [
      {
        "r": 0,
        "c": 0,
        "v": {
          "ct": {
            "fa": "@",
            "t": "s"
          },
          "fs": 20,
          "fc": "#000000",
          "ff": "黑体",
          "bl": 1,
          "ht": 0,
          "vt": 0,
          "tb": 1,
          "v": "签收单",
          "qp": 1,
          "m": "签收单",
          "mc": {
            "r": 0,
            "c": 0,
            "rs": 1,
            "cs": 8
          }
        }
      },
      {
        "r": 0,
        "c": 1,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 20,
          "fc": "#000000",
          "ff": "黑体",
          "bl": 1,
          "ht": 0,
          "vt": 0,
          "tb": 1,
          "mc": {
            "r": 0,
            "c": 0
          }
        }
      },
      {
        "r": 0,
        "c": 2,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 20,
          "fc": "#000000",
          "ff": "黑体",
          "bl": 1,
          "ht": 0,
          "vt": 0,
          "tb": 1,
          "mc": {
            "r": 0,
            "c": 0
          }
        }
      },
      {
        "r": 0,
        "c": 3,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 20,
          "fc": "#000000",
          "ff": "黑体",
          "bl": 1,
          "ht": 0,
          "vt": 0,
          "tb": 1,
          "mc": {
            "r": 0,
            "c": 0
          }
        }
      },
      {
        "r": 0,
        "c": 4,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 20,
          "fc": "#000000",
          "ff": "黑体",
          "bl": 1,
          "ht": 0,
          "vt": 0,
          "tb": 1,
          "mc": {
            "r": 0,
            "c": 0
          }
        }
      },
      {
        "r": 0,
        "c": 5,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 20,
          "fc": "#000000",
          "ff": "黑体",
          "bl": 1,
          "ht": 0,
          "vt": 0,
          "tb": 1,
          "mc": {
            "r": 0,
            "c": 0
          }
        }
      },
      {
        "r": 0,
        "c": 6,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 20,
          "fc": "#000000",
          "ff": "黑体",
          "bl": 1,
          "ht": 0,
          "vt": 0,
          "tb": 1,
          "mc": {
            "r": 0,
            "c": 0
          }
        }
      },
      {
        "r": 0,
        "c": 7,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 20,
          "fc": "#000000",
          "ff": "黑体",
          "bl": 1,
          "ht": 0,
          "vt": 0,
          "tb": 1,
          "mc": {
            "r": 0,
            "c": 0
          }
        }
      },
      {
        "r": 1,
        "c": 0,
        "v": {
          "ct": {
            "fa": "@",
            "t": "s"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "tb": 1,
          "v": "收货单位：",
          "qp": 1,
          "m": "收货单位："
        }
      },
      {
        "r": 1,
        "c": 1,
        "v": {
          "ct": {
            "fa": "@",
            "t": "s"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "v": selectedData.receiver,
          "qp": 1,
          "m": selectedData.receiver,
          "mc": {
            "r": 1,
            "c": 1,
            "rs": 1,
            "cs": 7
          }
        }
      },
      {
        "r": 1,
        "c": 2,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 1,
            "c": 1
          }
        }
      },
      {
        "r": 1,
        "c": 3,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 1,
            "c": 1
          }
        }
      },
      {
        "r": 1,
        "c": 4,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 1,
            "c": 1
          }
        }
      },
      {
        "r": 1,
        "c": 5,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 1,
            "c": 1
          }
        }
      },
      {
        "r": 1,
        "c": 6,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 1,
            "c": 1
          }
        }
      },
      {
        "r": 1,
        "c": 7,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 1,
            "c": 1
          }
        }
      },
      {
        "r": 2,
        "c": 0,
        "v": {
          "ct": {
            "fa": "@",
            "t": "s"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "tb": 1,
          "v": "项目名称：",
          "qp": 1,
          "m": "项目名称："
        }
      },
      {
        "r": 2,
        "c": 1,
        "v": {
          "ct": {
            "fa": "@",
            "t": "s"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "v": selectedData.projectName,
          "qp": 1,
          "m": selectedData.projectName,
          "mc": {
            "r": 2,
            "c": 1,
            "rs": 1,
            "cs": 7
          }
        }
      },
      {
        "r": 2,
        "c": 2,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 2,
            "c": 1
          }
        }
      },
      {
        "r": 2,
        "c": 3,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 2,
            "c": 1
          }
        }
      },
      {
        "r": 2,
        "c": 4,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 2,
            "c": 1
          }
        }
      },
      {
        "r": 2,
        "c": 5,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 2,
            "c": 1
          }
        }
      },
      {
        "r": 2,
        "c": 6,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 2,
            "c": 1
          }
        }
      },
      {
        "r": 2,
        "c": 7,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 2,
            "c": 1
          }
        }
      },
      {
        "r": 3,
        "c": 0,
        "v": {
          "ct": {
            "fa": "@",
            "t": "s"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "tb": 1,
          "v": "收货地址：",
          "qp": 1,
          "m": "收货地址："
        }
      },
      {
        "r": 3,
        "c": 1,
        "v": {
          "ct": {
            "fa": "@",
            "t": "s"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "v": selectedData.address,
          "qp": 1,
          "m": selectedData.address,
          "mc": {
            "r": 3,
            "c": 1,
            "rs": 1,
            "cs": 7
          }
        }
      },
      {
        "r": 3,
        "c": 2,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 3,
            "c": 1
          }
        }
      },
      {
        "r": 3,
        "c": 3,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 3,
            "c": 1
          }
        }
      },
      {
        "r": 3,
        "c": 4,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 3,
            "c": 1
          }
        }
      },
      {
        "r": 3,
        "c": 5,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 3,
            "c": 1
          }
        }
      },
      {
        "r": 3,
        "c": 6,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 3,
            "c": 1
          }
        }
      },
      {
        "r": 3,
        "c": 7,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 3,
            "c": 1
          }
        }
      },
      {
        "r": 4,
        "c": 0,
        "v": {
          "ct": {
            "fa": "@",
            "t": "s"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "tb": 1,
          "v": "收货人：",
          "qp": 1,
          "m": "收货人："
        }
      },
      {
        "r": 4,
        "c": 1,
        "v": {
          "ct": {
            "fa": "@",
            "t": "s"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "v": selectedData.receiveObj,
          "qp": 1,
          "m": selectedData.receiveObj,
          "mc": {
            "r": 4,
            "c": 1,
            "rs": 1,
            "cs": 7
          }
        }
      },
      {
        "r": 4,
        "c": 2,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 4,
            "c": 1
          }
        }
      },
      {
        "r": 4,
        "c": 3,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 4,
            "c": 1
          }
        }
      },
      {
        "r": 4,
        "c": 4,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 4,
            "c": 1
          }
        }
      },
      {
        "r": 4,
        "c": 5,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 4,
            "c": 1
          }
        }
      },
      {
        "r": 4,
        "c": 6,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 4,
            "c": 1
          }
        }
      },
      {
        "r": 4,
        "c": 7,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 4,
            "c": 1
          }
        }
      },
      {
        "r": 5,
        "c": 0,
        "v": {
          "ct": {
            "fa": "@",
            "t": "s"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "tb": 1,
          "v": "送货日期：",
          "qp": 1,
          "m": "送货日期："
        }
      },
      {
        "r": 5,
        "c": 1,
        "v": {
          "ct": {
            "fa": "@",
            "t": "s"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "v": selectedData.sendDate,
          "qp": 1,
          "m": selectedData.sendDate,
          "mc": {
            "r": 5,
            "c": 1,
            "rs": 1,
            "cs": 7
          }
        }
      },
      {
        "r": 5,
        "c": 2,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 5,
            "c": 1
          }
        }
      },
      {
        "r": 5,
        "c": 3,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 5,
            "c": 1
          }
        }
      },
      {
        "r": 5,
        "c": 4,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 5,
            "c": 1
          }
        }
      },
      {
        "r": 5,
        "c": 5,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 5,
            "c": 1
          }
        }
      },
      {
        "r": 5,
        "c": 6,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 5,
            "c": 1
          }
        }
      },
      {
        "r": 5,
        "c": 7,
        "v": {
          "ct": {
            "fa": "General"
          },
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "ht": 1,
          "tb": 1,
          "mc": {
            "r": 5,
            "c": 1
          }
        }
      },
      {
        "r": 6,
        "c": 0,
        "v": {
          "ct": {
            "fa": "@",
            "t": "s"
          },
          "bg": blue,
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "bl": 1,
          "ht": 0,
          "vt": 0,
          "tb": 1,
          "v": "名称",
          "qp": 1,
          "m": "名称"
        }
      },
      {
        "r": 6,
        "c": 1,
        "v": {
          "ct": {
            "fa": "@",
            "t": "s"
          },
          "bg": blue,
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "bl": 1,
          "ht": 0,
          "vt": 0,
          "tb": 1,
          "v": "型号",
          "qp": 1,
          "m": "型号"
        }
      },
      {
        "r": 6,
        "c": 2,
        "v": {
          "ct": {
            "fa": "@",
            "t": "s"
          },
          "bg": blue,
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "bl": 1,
          "ht": 0,
          "vt": 0,
          "tb": 1,
          "v": "规格（长*宽）",
          "qp": 1,
          "m": "规格（长*宽）",
          "mc": {
            "r": 6,
            "c": 2,
            "rs": 1,
            "cs": 2
          }
        }
      },
      {
        "r": 6,
        "c": 3,
        "v": {
          "ct": {
            "fa": "General"
          },
          "bg": blue,
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "bl": 1,
          "ht": 0,
          "vt": 0,
          "tb": 1,
          "mc": {
            "r": 6,
            "c": 2
          }
        }
      },
      {
        "r": 6,
        "c": 4,
        "v": {
          "ct": {
            "fa": "@",
            "t": "s"
          },
          "bg": blue,
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "bl": 1,
          "ht": 0,
          "vt": 0,
          "tb": 1,
          "v": "数量（片）",
          "qp": 1,
          "m": "数量（片）"
        }
      },
      {
        "r": 6,
        "c": 5,
        "v": {
          "ct": {
            "fa": "@",
            "t": "s"
          },
          "bg": blue,
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "bl": 1,
          "ht": 0,
          "vt": 0,
          "tb": 1,
          "v": "面积（m2）",
          "qp": 1,
          "m": "面积（m2）"
        }
      },
      {
        "r": 6,
        "c": 6,
        "v": {
          "ct": {
            "fa": "@",
            "t": "s"
          },
          "bg": blue,
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "bl": 1,
          "ht": 0,
          "vt": 0,
          "tb": 1,
          "v": "位置",
          "qp": 1,
          "m": "位置"
        }
      },
      {
        "r": 6,
        "c": 7,
        "v": {
          "ct": {
            "fa": "@",
            "t": "s"
          },
          "bg": blue,
          "fs": 11,
          "fc": "#000000",
          "ff": "黑体",
          "bl": 1,
          "ht": 0,
          "vt": 0,
          "tb": 1,
          "v": "户型",
          "qp": 1,
          "m": "户型"
        }
      }
    ]
  };
};
export default {
  getNoticeEnterSheet,
  getNoticeQuerySheet,
  getMotherBillSheet,
  getMBQuerySheet,
  getMotherBillArrangeSheet,
  getTags,
  getProductOutputSheet,
  getPOItemEntrySheet,
  getPOItemEntrySpare,
  getPOOther,
  getLargeProject
};
